In [1]:
import pandas as pd
import numpy as np

from pandas import DataFrame

In [4]:
dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a','a', 'b','b', 'c','c','c'],
    'coluna 3': ['A', 'A', 'B', 'B', 'C', 'C', 'C'],
}

df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [5]:
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [9]:
df.drop_duplicates()

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

In [10]:
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [11]:
df.drop_duplicates(inplace=True)

In [12]:
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

In [14]:
dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a','a', 'b','b', 'c','c','c'],
    'coluna 3': ['D', 'A', 'B', 'B', 'C', 'C', 'C'],
}

df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [16]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
6     True
dtype: bool